Revit 2027 API
DirectContext3DDocumentUtils.GetDirectContext3DHandleTypes Method
 Returns all DirectContext3D handle types of the given category in the document.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetDirectContext3DHandleTypes(
	Document aDocument,
	ElementId handleCategory
)
Public Shared Function GetDirectContext3DHandleTypes (
	aDocument As Document,
	handleCategory As ElementId
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetDirectContext3DHandleTypes(
	Document^ aDocument,
	ElementId^ handleCategory
)
static member GetDirectContext3DHandleTypes :
        aDocument : Document *
        handleCategory : ElementId -> ISet<ElementId>
Parameters
aDocument Document
 The document.
handleCategory ElementId
 A category of DirectContext3D handles.
Return Value
ISet<ElementId>
 The set of DirectContext3D handle types of the given category.
Exceptions
Exception | Condition
ArgumentException |  the category ID handleCategory is not valid for DirectContext3D handles.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DDocumentUtils Class
Autodesk.Revit.DB.DirectContext3D Namespace